      ******************************************************************
      * Author: CRISTHIAN JAIMES
      * Date:28-2-2023
      * Purpose:APRENDIZAJE
      * Tectonics:
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.

       ENVIRONMENT DIVISION.
      *DONDE VA EL ARCHIVO FISICO DE LA BASE
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
      *ARCHIVO FISICO DE LA BASE DE DATOS
       SELECT OPTIONAL EMPLEADOS-ARCHIVO
       ASSIGN TO "EMPLEADOS.DAT"
       ORGANIZATION IS SEQUENTIAL.


       DATA DIVISION.
       FILE SECTION.
      *ARCHIVO LOGICO DE BASE DE DATOS-ALMACENAN
      *REGISTROS DE USUARIOS
      * FD FILE DESCRIPTIO
       FD EMPLEADOS-ARCHIVO.

          01 EMPLEADOS-REGISTRO.
              05 EMPLEADOS-ID PIC X(6).
              05 EMPLEADOS-NOMBRE PIC X(25).
              05 EMPLEADOS-APELLIDOS PIC X(35).
              05 EMPLEADOS-EDAD PIC X(3).
              05 EMPLEADOS-TELEFONO PIC X(9).
              05 EMPLEADOS-DIRECCION PIC X(35).


       WORKING-STORAGE SECTION.

       01 IDENTIFICADOR PIC X(36)
          VALUE "INTRODUCE UN ID DEL EMPLEADO: ".
       01 NOMBRE PIC X(33)
          VALUE "INTRODUCE UN NOMBRE DE EMPLEADO: ".
       01 APELLIDOS PIC X(25)
          VALUE "INTRODUCE LOS APELLIDOS".
       01 EDAD PIC X(19)
          VALUE "INTRODUCE LA EDAD: ".
       01 TELEFONO PIC X(33)
          VALUE "INTRODUCE TELEFONO: ".
       01 DIRECCION PIC X(25)
          VALUE "INTRODUCE DIRECCION: ".

       01 SI-NO PIC X.
       01 ENTRY-OK PIC X.

       PROCEDURE DIVISION.
       MAIN-LOGIC SECTION.
       PROGRAM-BEGIN.

           PERFORM PROCEDIMIENTO-DE-APERTURA.
           MOVE "S" TO SI-NO.
           PERFORM AGREGAR-REGISTROS
           UNTIL SI-NO = "N".
           PERFORM PROCEDIMIENTO-DE-CIERRE.

       PROGRAM-DONE.
            STOP RUN.

       PROCEDIMIENTO-DE-APERTURA.
      * ABRIR BASE DE DATOS Y LA CREA SI NO EXISTE (I-O INPUT OUTPUT)
           OPEN EXTEND EMPLEADOS-ARCHIVO.

       PROCEDIMIENTO-DE-CIERRE.
      * CERRAR BASE
           CLOSE EMPLEADOS-ARCHIVO.

       AGREGAR-REGISTROS.
           MOVE "N" TO ENTRY-OK.
           PERFORM OBTENER-CAMPOS
           UNTIL ENTRY-OK = "S".
           PERFORM ESCRIBIR-REGISTRO.
           PERFORM REINICIAR.

       OBTENER-CAMPOS.
           MOVE SPACE TO EMPLEADOS-REGISTRO.
           DISPLAY IDENTIFICADOR " ? ".
           ACCEPT EMPLEADOS-ID.
           DISPLAY NOMBRE " ? ".
           ACCEPT EMPLEADOS-NOMBRE.
           DISPLAY APELLIDOS " ? ".
           ACCEPT EMPLEADOS-APELLIDOS.
           DISPLAY EDAD " ? ".
           ACCEPT EMPLEADOS-EDAD.
           DISPLAY TELEFONO " ? ".
           ACCEPT EMPLEADOS-TELEFONO.
           DISPLAY DIRECCION " ? ".
           ACCEPT EMPLEADOS-DIRECCION
           PERFORM VALIDAR-CAMPOS.

       VALIDAR-CAMPOS.
           MOVE "S" TO ENTRY-OK.
           IF EMPLEADOS-NOMBRE = SPACE
           DISPLAY "ERROR: DEBES ESPECIFICAR NOMBRE."
           MOVE "N" TO ENTRY-OK.


       ESCRIBIR-REGISTRO.
      * PARA PODER ESCRIBIR EN LA BASE
           WRITE EMPLEADOS-REGISTRO.

       REINICIAR.
           DISPLAY "DESEA ALMACENAR OTRO REGISTRO EN LA BASE DE DATOS?".
           ACCEPT SI-NO.
           IF SI-NO = "S"
           MOVE "S" TO SI-NO.
           IF SI-NO NOT = "S"
           MOVE "N" TO SI-NO.


       END PROGRAM YOUR-PROGRAM-NAME.
